package com.sist.io2;
/*
 *    데이터 연결 : 자바응용프로그램
 *               ------------ .java
 *    데이터 저장 : 변수, 배열, 클래스, 파일, 오라클
 *               --------------- 메모리 (단점 => 한번 사용하면 지워진다)
 *               파일 : 영구적으로 저장 (보안취약, 다른 파일 연결 어려움)
 *               -------------------------------
 *               Spring : Web 제어
 *               MyBatis : Mapper(데이터베이스 연결)
 *               -------------------------------
 *    
 *    데이터 => 읽기 / 쓰기
 *    ----
 *     |
 *    파일: Stream(1byte) / Reader(2byte)
 */
public class IO_정리 {

}
