/*
 *    1. 클래스 구성 요소
 *    class ClassName{
 *      ------------------------
 *       변수(인스턴스, 맴버, 공유)
 *        = 따로 저장되는 변수 (인스턴스 변수 => new)
 *        = 공통 저장 변수 (컴파일러에 의해 자동 생성) => 한개의 메모리만 생성
 *      ------------------------
 *       메소드(맴버메소드) => static이 없는 메소드
 *      ------------------------
 *       생성자 : 맴버변수의 초기화, 객체 생성시에 호출되는 메소드
 *    }
 *    
 *    ***** class블럭에서는 연산자, 제어문을 사용할 수 없다
 *          선언만 가능하다 변수값을 지정할때는 선언과 동시에 설정한다
 *          
 *          
 *    1. 객체지향 프로그램(OOP)
 *       = 여러개의 클래스를 만들어서 조립하는 프로그램
 *       예) 웹 사이트
 *          회원 : 회원가입, 회원탈퇴, 회원수정, 로그인, 로그아웃, 아이디찾기...
 *          ---- 부품
 *          게시판 : 글쓰기, 수정, 상세보기, 삭제, 찾기...
 *          맛집 : 목록, 상세보기, 댓글, 찾기
 *          
 */
public class 클래스_변수정리 {

}
