/*
 *    1. 단일 조건문
 *       형식)
 *           if(조건문)
 *           {
 *              수행문 => 조건이 true일시 수행
 *              ---- 부정연산자(!), 비교연산자(==, !=, <, >, <=, >=)
 *                   논리연산자(&&, ||)만 사용이 가능
 *           }
 *    2. 선택 조건문
 *           if(조건문)
 *           {
 *              수행문
 *           }
 *           else
 *           {
 *              수행문 => 조건이 false일때 수행
 *           } => else문장은 바로 위에 있는 if문 소속이다
 *           
 *           if()
 *           {
 *           }
 *           ---------
 *           if()
 *           {
 *           }
 *           else()
 *           {
 *           }
 *           ---------
 *           => else문은 단독으로 사용이 불가능하다(if 반드시 사용)
 *    3. 다중 조건문
 *       if(조건문)
 *       {
 *           조건문이 true일때 수행 => 종료
 *           조건문이 false => 다음 조건을 찾는다
 *       }
 *       else if(조건문)
 *       {
 *       }
 *       else
 *       {
 *          // 해당 조건이 없는 경우 처리하는 소스 작성
 *       }
 *    4. 선택문
 *    5. 반복문(for - 1차)
 *    
 */
public class 제어문_정리 {

}
